Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.mcp.agentSetup.mcp.agent.copy
source: Copy Agent Prompt
ar: نسخ مطالبة الوكيل
de: Agent-Prompt kopieren
es: Copiar indicación para agente
fr: Copier l'invite pour l'agent
id: Salin Prompt Agen
it: Copia prompt agente
ja: エージェントプロンプトをコピー
ko: 에이전트 프롬프트 복사
nl: Agentprompt kopiëren
pl: Kopiuj prompt agenta
pt_br: Copiar Comando do Agente
ru: Копировать запрос для агента
tr: Aracı İstemini Kopyala
uk: Копіювати запит для агента
vi: Sao chép lời nhắc tác nhân
zh_hans: 复制 Agent Prompt
zh_hant: 複製 Agent Prompt

# settings.mcp.agentSetup.mcp.agent.help
source: Ask Codex, Claude Code, or another AI agent to configure and verify the MCP service.
ar: اطلب من Codex أو Claude Code أو أي وكيل ذكاء اصطناعي آخر تكوين خدمة MCP والتحقق منها.
de: Bitten Sie Codex, Claude Code oder einen anderen KI-Agenten, den MCP-Dienst zu konfigurieren und zu überprüfen.
es: Pídele a Codex, Claude Code u otro agente de IA que configure y verifique el servicio MCP.
fr: Demandez à Codex, Claude Code ou un autre agent IA de configurer et vérifier le service MCP.
id: Minta Codex, Claude Code, atau agen AI lain untuk mengonfigurasi dan memverifikasi layanan MCP.
it: Chiedi a Codex, Claude Code o un altro agente AI di configurare e verificare il servizio MCP.
ja: Codex、Claude Code、または他のAIエージェントにMCPサービスの設定と確認を依頼します。
ko: Codex, Claude Code 또는 다른 AI 에이전트에게 MCP 서비스를 구성하고 확인하도록 요청하세요.
nl: Vraag Codex, Claude Code of een andere AI-agent om de MCP-service te configureren en te verifiëren.
pl: Poproś Codex, Claude Code lub innego agenta AI o skonfigurowanie i zweryfikowanie usługi MCP.
pt_br: Peça ao Codex, Claude Code ou outro agente de IA para configurar e verificar o serviço MCP.
ru: Попросите Codex, Claude Code или другого ИИ-агента настроить и проверить MCP-сервис.
tr: Codex, Claude Code veya başka bir yapay zeka aracısından MCP servisini yapılandırmasını ve doğrulamasını isteyin.
uk: Попросіть Codex, Claude Code або іншого AI-агента налаштувати та перевірити MCP-сервіс.
vi: Yêu cầu Codex, Claude Code hoặc tác nhân AI khác cấu hình và xác minh dịch vụ MCP.
zh_hans: 让 Codex、Claude Code 或其他 AI Agent 配置并验证 MCP Service。
zh_hant: 讓 Codex、Claude Code 或其他 AI Agent 設定並驗證 MCP Service。

# settings.mcp.agentSetup.mcp.agent.title
source: Configure with an AI Agent
ar: التكوين باستخدام وكيل ذكاء اصطناعي
de: Mit einem KI-Agenten konfigurieren
es: Configurar con un agente de IA
fr: Configurer avec un agent IA
id: Konfigurasi dengan Agen AI
it: Configura con un agente AI
ja: AIエージェントで設定
ko: AI 에이전트로 구성
nl: Configureren met een AI-agent
pl: Skonfiguruj za pomocą agenta AI
pt_br: Configurar com um Agente de IA
ru: Настроить через ИИ-агента
tr: Bir Yapay Zeka Aracısı ile Yapılandır
uk: Налаштувати за допомогою AI-агента
vi: Cấu hình bằng tác nhân AI
zh_hans: 使用 AI Agent 配置
zh_hant: 使用 AI Agent 設定

# settings.mcp.agentSetup.mcp.claude.copy
source: Copy Claude JSON
ar: نسخ JSON لـ Claude
de: Claude JSON kopieren
es: Copiar JSON de Claude
fr: Copier le JSON Claude
id: Salin JSON Claude
it: Copia JSON Claude
ja: Claude JSONをコピー
ko: Claude JSON 복사
nl: Claude JSON kopiëren
pl: Kopiuj JSON Claude
pt_br: Copiar JSON do Claude
ru: Копировать JSON для Claude
tr: Claude JSON'u Kopyala
uk: Копіювати JSON для Claude
vi: Sao chép JSON Claude
zh_hans: 复制 Claude JSON
zh_hant: 複製 Claude JSON

# settings.mcp.agentSetup.mcp.claude.help
source: Copy a user-level stdio MCP Server JSON configuration for Claude Code.
ar: انسخ تكوين JSON لخادم MCP عبر stdio على مستوى المستخدم لـ Claude Code.
de: Kopieren Sie eine benutzerebene stdio MCP Server JSON-Konfiguration für Claude Code.
es: Copia una configuración JSON de servidor MCP stdio a nivel de usuario para Claude Code.
fr: Copiez une configuration JSON de serveur MCP stdio au niveau utilisateur pour Claude Code.
id: Salin konfigurasi JSON Server MCP stdio tingkat pengguna untuk Claude Code.
it: Copia una configurazione JSON del server MCP stdio a livello utente per Claude Code.
ja: Claude Code用のユーザーレベルのstdio MCPサーバーJSON設定をコピーします。
ko: Claude Code용 사용자 수준 stdio MCP 서버 JSON 구성을 복사합니다.
nl: Kopieer een JSON-configuratie voor een stdio MCP-server op gebruikersniveau voor Claude Code.
pl: Skopiuj konfigurację JSON serwera MCP stdio na poziomie użytkownika dla Claude Code.
pt_br: Copie uma configuração JSON de Servidor MCP stdio em nível de usuário para o Claude Code.
ru: Скопируйте конфигурацию MCP-сервера stdio на уровне пользователя для Claude Code.
tr: Claude Code için kullanıcı düzeyinde bir stdio MCP Sunucusu JSON yapılandırmasını kopyalayın.
uk: Скопіюйте конфігурацію MCP-сервера stdio на рівні користувача для Claude Code.
vi: Sao chép cấu hình JSON MCP Server stdio cấp người dùng cho Claude Code.
zh_hans: 复制供 Claude Code 使用的用户级 stdio MCP Server JSON 配置。
zh_hant: 複製供 Claude Code 使用的使用者級 stdio MCP Server JSON 設定。

# settings.mcp.agentSetup.mcp.codex.copy
source: Copy Codex TOML
ar: نسخ TOML لـ Codex
de: Codex TOML kopieren
es: Copiar TOML de Codex
fr: Copier le TOML Codex
id: Salin TOML Codex
it: Copia TOML Codex
ja: Codex TOMLをコピー
ko: Codex TOML 복사
nl: Codex TOML kopiëren
pl: Kopiuj TOML Codex
pt_br: Copiar TOML do Codex
ru: Копировать TOML для Codex
tr: Codex TOML'u Kopyala
uk: Копіювати TOML для Codex
vi: Sao chép TOML Codex
zh_hans: 复制 Codex TOML
zh_hant: 複製 Codex TOML

# settings.mcp.agentSetup.mcp.codex.help
source: Copy a user-level stdio MCP Server TOML configuration for Codex.
ar: انسخ تكوين TOML لخادم MCP عبر stdio على مستوى المستخدم لـ Codex.
de: Kopieren Sie eine benutzerebene stdio MCP Server TOML-Konfiguration für Codex.
es: Copia una configuración TOML de servidor MCP stdio a nivel de usuario para Codex.
fr: Copiez une configuration TOML de serveur MCP stdio au niveau utilisateur pour Codex.
id: Salin konfigurasi TOML Server MCP stdio tingkat pengguna untuk Codex.
it: Copia una configurazione TOML del server MCP stdio a livello utente per Codex.
ja: Codex用のユーザーレベルのstdio MCPサーバーTOML設定をコピーします。
ko: Codex용 사용자 수준 stdio MCP 서버 TOML 구성을 복사합니다.
nl: Kopieer een TOML-configuratie voor een stdio MCP-server op gebruikersniveau voor Codex.
pl: Skopiuj konfigurację TOML serwera MCP stdio na poziomie użytkownika dla Codex.
pt_br: Copie uma configuração TOML de Servidor MCP stdio em nível de usuário para o Codex.
ru: Скопируйте конфигурацию MCP-сервера stdio на уровне пользователя для Codex.
tr: Codex için kullanıcı düzeyinde bir stdio MCP Sunucusu TOML yapılandırmasını kopyalayın.
uk: Скопіюйте конфігурацію MCP-сервера stdio у форматі TOML на рівні користувача для Codex.
vi: Sao chép cấu hình TOML MCP Server stdio cấp người dùng cho Codex.
zh_hans: 复制供 Codex 使用的用户级 stdio MCP Server TOML 配置。
zh_hant: 複製供 Codex 使用的使用者級 stdio MCP Server TOML 設定。

# settings.mcp.agentSetup.mcp.configuration.help
source: The copied configuration uses the local Starcat CLI path. Keep Starcat running with MCP Service enabled, reload the client, then call starcat.get_capabilities. Do not add an endpoint or Local API Key.
ar: يستخدم التكوين المنسوخ مسار Starcat CLI المحلي. أبقِ Starcat قيد التشغيل مع تمكين خدمة MCP، وأعد تحميل العميل، ثم استدعِ starcat.get_capabilities. لا تضف نقطة نهاية أو مفتاح API محلي.
de: Die kopierte Konfiguration verwendet den lokalen Starcat CLI-Pfad. Lassen Sie Starcat mit aktiviertem MCP-Dienst laufen, laden Sie den Client neu und rufen Sie dann starcat.get_capabilities auf. Fügen Sie keinen Endpunkt oder lokalen API-Schlüssel hinzu.
es: La configuración copiada usa la ruta local de la CLI de Starcat. Mantén Starcat ejecutándose con el servicio MCP habilitado, recarga el cliente y luego llama a starcat.get_capabilities. No agregues un endpoint ni una clave API local.
fr: La configuration copiée utilise le chemin local de la CLI Starcat. Gardez Starcat ouvert avec le service MCP activé, rechargez le client, puis appelez starcat.get_capabilities. N'ajoutez pas de point de terminaison ni de clé API locale.
id: Konfigurasi yang disalin menggunakan jalur Starcat CLI lokal. Biarkan Starcat berjalan dengan Layanan MCP diaktifkan, muat ulang klien, lalu panggil starcat.get_capabilities. Jangan menambahkan endpoint atau Kunci API Lokal.
it: La configurazione copiata utilizza il percorso locale della CLI di Starcat. Tieni Starcat in esecuzione con il servizio MCP abilitato, ricarica il client, quindi chiama starcat.get_capabilities. Non aggiungere un endpoint o una chiave API locale.
ja: コピーされた設定はローカルのStarcat CLIパスを使用します。StarcatをMCPサービスを有効にして起動したままにし、クライアントをリロードしてからstarcat.get_capabilitiesを呼び出してください。エンドポイントやローカルAPIキーを追加しないでください。
ko: 복사된 구성은 로컬 Starcat CLI 경로를 사용합니다. MCP 서비스를 활성화한 상태로 Starcat를 실행하고, 클라이언트를 다시 로드한 다음 starcat.get_capabilities를 호출하세요. 엔드포인트나 로컬 API 키를 추가하지 마십시오.
nl: De gekopieerde configuratie gebruikt het lokale Starcat CLI-pad. Houd Starcat actief met MCP-service ingeschakeld, laad de client opnieuw en roep vervolgens starcat.get_capabilities aan. Voeg geen eindpunt of lokale API-sleutel toe.
pl: Skopiowana konfiguracja używa lokalnej ścieżki Starcat CLI. Utrzymuj Starcat uruchomione z włączoną usługą MCP, przeładuj klienta, a następnie wywołaj starcat.get_capabilities. Nie dodawaj punktu końcowego ani lokalnego klucza API.
pt_br: A configuração copiada usa o caminho local da CLI do Starcat. Mantenha o Starcat em execução com o Serviço MCP ativado, recarregue o cliente e, em seguida, chame starcat.get_capabilities. Não adicione um endpoint ou Chave de API Local.
ru: Скопированная конфигурация использует локальный путь к Starcat CLI. Держите Starcat запущенным с включённым MCP-сервисом, перезагрузите клиент, затем вызовите starcat.get_capabilities. Не добавляйте конечную точку или локальный API-ключ.
tr: Kopyalanan yapılandırma, yerel Starcat CLI yolunu kullanır. MCP Servisi etkinken Starcat'ı çalışır durumda tutun, istemciyi yeniden yükleyin, ardından starcat.get_capabilities'ı çağırın. Bir uç nokta veya Yerel API Anahtarı eklemeyin.
uk: Скопійована конфігурація використовує локальний шлях до Starcat CLI. Тримайте Starcat запущеним з увімкненим MCP-сервісом, перезавантажте клієнт, потім викличте starcat.get_capabilities. Не додавайте кінцеву точку або локальний API-ключ.
vi: Cấu hình đã sao chép sử dụng đường dẫn Starcat CLI cục bộ. Giữ Starcat chạy với dịch vụ MCP được bật, tải lại ứng dụng khách, sau đó gọi starcat.get_capabilities. Không thêm điểm cuối hoặc Khóa API cục bộ.
zh_hans: 复制内容使用本机 Starcat CLI 路径。请保持 Starcat 运行并开启 MCP Service，重新加载客户端后调用 starcat.get_capabilities；不要添加 endpoint 或 Local API Key。
zh_hant: 複製內容使用本機 Starcat CLI 路徑。請保持 Starcat 執行並開啟 MCP Service，重新載入用戶端後呼叫 starcat.get_capabilities；不要新增 endpoint 或 Local API Key。

# settings.mcp.agentSetup.mcp.manual.copy
source: Copy Manual Setup
ar: نسخ الإعداد اليدوي
de: Manuelle Einrichtung kopieren
es: Copiar configuración manual
fr: Copier la configuration manuelle
id: Salin Pengaturan Manual
it: Copia configurazione manuale
ja: 手動設定をコピー
ko: 수동 설정 복사
nl: Handmatige installatie kopiëren
pl: Kopiuj konfigurację ręczną
pt_br: Copiar Configuração Manual
ru: Копировать ручную настройку
tr: Manuel Kurulumu Kopyala
uk: Копіювати ручне налаштування
vi: Sao chép thiết lập thủ công
zh_hans: 复制手动安装说明
zh_hant: 複製手動安裝說明

# settings.mcp.agentSetup.mcp.manual.help
source: Copy the user-level stdio server settings and configure starcat mcp in your MCP client.
ar: انسخ إعدادات خادم stdio على مستوى المستخدم وقم بتكوين starcat mcp في عميل MCP الخاص بك.
de: Kopieren Sie die benutzerebene stdio-Server-Einstellungen und konfigurieren Sie starcat mcp in Ihrem MCP-Client.
es: Copia la configuración del servidor stdio a nivel de usuario y configura starcat mcp en tu cliente MCP.
fr: Copiez les paramètres de serveur stdio au niveau utilisateur et configurez starcat mcp dans votre client MCP.
id: Salin pengaturan server stdio tingkat pengguna dan konfigurasikan starcat mcp di klien MCP Anda.
it: Copia le impostazioni del server stdio a livello utente e configura starcat mcp nel tuo client MCP.
ja: ユーザーレベルのstdioサーバー設定をコピーし、MCPクライアントでstarcat mcpを設定します。
ko: 사용자 수준 stdio 서버 설정을 복사하고 MCP 클라이언트에서 starcat mcp를 구성하세요.
nl: Kopieer de stdio-serverinstellingen op gebruikersniveau en configureer starcat mcp in je MCP-client.
pl: Skopiuj ustawienia serwera stdio na poziomie użytkownika i skonfiguruj starcat mcp w swoim kliencie MCP.
pt_br: Copie as configurações do servidor stdio em nível de usuário e configure starcat mcp no seu cliente MCP.
ru: Скопируйте настройки сервера stdio на уровне пользователя и настройте starcat mcp в вашем MCP-клиенте.
tr: Kullanıcı düzeyindeki stdio sunucu ayarlarını kopyalayın ve MCP istemcinizde starcat mcp'yi yapılandırın.
uk: Скопіюйте налаштування сервера stdio на рівні користувача та налаштуйте starcat mcp у вашому MCP-клієнті.
vi: Sao chép cài đặt máy chủ stdio cấp người dùng và cấu hình starcat mcp trong ứng dụng khách MCP của bạn.
zh_hans: 复制用户级 stdio Server 配置，并在 MCP 客户端中手动配置 starcat mcp。
zh_hant: 複製使用者級 stdio Server 設定，並在 MCP 用戶端中手動設定 starcat mcp。

# settings.mcp.agentSetup.mcp.manual.title
source: Configure manually
ar: التكوين يدويًا
de: Manuell konfigurieren
es: Configurar manualmente
fr: Configurer manuellement
id: Konfigurasi secara manual
it: Configura manualmente
ja: 手動で設定
ko: 수동으로 구성
nl: Handmatig configureren
pl: Skonfiguruj ręcznie
pt_br: Configurar manualmente
ru: Настроить вручную
tr: Manuel yapılandır
uk: Налаштувати вручну
vi: Cấu hình thủ công
zh_hans: 手动配置
zh_hant: 手動設定

# settings.mcp.agentSetup.mcp.title
source: Install MCP Service
ar: تثبيت خدمة MCP
de: MCP-Dienst installieren
es: Instalar servicio MCP
fr: Installer le service MCP
id: Instal Layanan MCP
it: Installa servizio MCP
ja: MCPサービスをインストール
ko: MCP 서비스 설치
nl: MCP-service installeren
pl: Zainstaluj usługę MCP
pt_br: Instalar Serviço MCP
ru: Установить MCP-сервис
tr: MCP Servisini Kur
uk: Встановити MCP-сервіс
vi: Cài đặt dịch vụ MCP
zh_hans: 安装 MCP Service
zh_hant: 安裝 MCP Service

# settings.mcp.agentSetup.mcpManualPrompt
source: # Configure Starcat MCP Service Manually 1. Run `command -v starcat` and copy the absolute path. 2. Add a user-level stdio MCP Server to your client: - Name: starcat - Command: the absolute path from step 1 - Args: ["mcp"] - Transport: stdio 3. Keep Starcat running with MCP Service enabled. 4. Restart or reload the MCP client, then complete initialize and tools/list, and call the read-only tool starcat.get_capabilities. Do not configure an endpoint or Local API Key in the MCP client.
ar: # تكوين خدمة Starcat MCP يدويًا 1. شغّل `command -v starcat` وانسخ المسار المطلق. 2. أضف خادم MCP عبر stdio على مستوى المستخدم إلى عميلك: - الاسم: starcat - الأمر: المسار المطلق من الخطوة 1 - الوسائط: ["mcp"] - النقل: stdio 3. أبقِ Starcat قيد التشغيل مع تمكين خدمة MCP. 4. أعد تشغيل أو أعد تحميل عميل MCP، ثم أكمل initialize و tools/list، واستدعِ أداة القراءة فقط starcat.get_capabilities. لا تقم بتكوين نقطة نهاية أو مفتاح API محلي في عميل MCP.
de: # Starcat MCP-Dienst manuell konfigurieren 1. Führen Sie `command -v starcat` aus und kopieren Sie den absoluten Pfad. 2. Fügen Sie Ihrem Client einen benutzerebenen stdio MCP Server hinzu: - Name: starcat - Befehl: der absolute Pfad aus Schritt 1 - Args: ["mcp"] - Transport: stdio 3. Lassen Sie Starcat mit aktiviertem MCP-Dienst laufen. 4. Starten Sie den MCP-Client neu oder laden Sie ihn neu, führen Sie dann initialize und tools/list aus und rufen Sie das schreibgeschützte Tool starcat.get_capabilities auf. Konfigurieren Sie keinen Endpunkt oder lokalen API-Schlüssel im MCP-Client.
es: # Configurar el servicio MCP de Starcat manualmente 1. Ejecuta `command -v starcat` y copia la ruta absoluta. 2. Agrega un servidor MCP stdio a nivel de usuario en tu cliente: - Nombre: starcat - Comando: la ruta absoluta del paso 1 - Args: ["mcp"] - Transporte: stdio 3. Mantén Starcat ejecutándose con el servicio MCP habilitado. 4. Reinicia o recarga el cliente MCP, luego completa initialize y tools/list, y llama a la herramienta de solo lectura starcat.get_capabilities. No configures un endpoint ni una clave API local en el cliente MCP.
fr: # Configurer manuellement le service MCP Starcat 1. Exécutez `command -v starcat` et copiez le chemin absolu. 2. Ajoutez un serveur MCP stdio au niveau utilisateur dans votre client : - Nom : starcat - Commande : le chemin absolu de l'étape 1 - Args : ["mcp"] - Transport : stdio 3. Gardez Starcat ouvert avec le service MCP activé. 4. Redémarrez ou rechargez le client MCP, puis effectuez initialize et tools/list, et appelez l'outil en lecture seule starcat.get_capabilities. Ne configurez pas de point de terminaison ni de clé API locale dans le client MCP.
id: # Konfigurasi Layanan MCP Starcat Secara Manual 1. Jalankan `command -v starcat` dan salin jalur absolut. 2. Tambahkan Server MCP stdio tingkat pengguna ke klien Anda: - Nama: starcat - Perintah: jalur absolut dari langkah 1 - Arg: ["mcp"] - Transport: stdio 3. Biarkan Starcat berjalan dengan Layanan MCP diaktifkan. 4. Mulai ulang atau muat ulang klien MCP, lalu selesaikan initialize dan tools/list, dan panggil alat hanya-baca starcat.get_capabilities. Jangan konfigurasikan endpoint atau Kunci API Lokal di klien MCP.
it: # Configura manualmente il servizio MCP di Starcat 1. Esegui `command -v starcat` e copia il percorso assoluto. 2. Aggiungi un server MCP stdio a livello utente al tuo client: - Nome: starcat - Comando: il percorso assoluto dal punto 1 - Argomenti: ["mcp"] - Trasporto: stdio 3. Tieni Starcat in esecuzione con il servizio MCP abilitato. 4. Riavvia o ricarica il client MCP, quindi completa initialize e tools/list, e chiama lo strumento di sola lettura starcat.get_capabilities. Non configurare un endpoint o una chiave API locale nel client MCP.
ja: # Starcat MCPサービスを手動で設定 1. `command -v starcat`を実行し、絶対パスをコピーします。 2. クライアントにユーザーレベルのstdio MCPサーバーを追加: - 名前: starcat - コマンド: 手順1の絶対パス - 引数: ["mcp"] - トランスポート: stdio 3. StarcatをMCPサービスを有効にして起動したままにします。 4. MCPクライアントを再起動またはリロードし、initializeとtools/listを完了し、読み取り専用ツールstarcat.get_capabilitiesを呼び出します。 MCPクライアントにエンドポイントやローカルAPIキーを設定しないでください。
ko: # Starcat MCP 서비스 수동 구성 1. `command -v starcat`을 실행하고 절대 경로를 복사합니다. 2. 클라이언트에 사용자 수준 stdio MCP 서버를 추가합니다: - 이름: starcat - 명령: 1단계의 절대 경로 - 인수: ["mcp"] - 전송: stdio 3. MCP 서비스를 활성화한 상태로 Starcat를 실행합니다. 4. MCP 클라이언트를 다시 시작하거나 다시 로드한 다음 initialize 및 tools/list를 완료하고 읽기 전용 도구 starcat.get_capabilities를 호출합니다. MCP 클라이언트에 엔드포인트나 로컬 API 키를 구성하지 마십시오.
nl: # Starcat MCP-service handmatig configureren 1. Voer `command -v starcat` uit en kopieer het absolute pad. 2. Voeg een stdio MCP-server op gebruikersniveau toe aan je client: - Naam: starcat - Opdracht: het absolute pad uit stap 1 - Argumenten: ["mcp"] - Transport: stdio 3. Houd Starcat actief met MCP-service ingeschakeld. 4. Start de MCP-client opnieuw of laad deze opnieuw, voltooi vervolgens initialize en tools/list, en roep de alleen-lezen tool starcat.get_capabilities aan. Configureer geen eindpunt of lokale API-sleutel in de MCP-client.
pl: # Ręczna konfiguracja usługi MCP Starcat 1. Uruchom `command -v starcat` i skopiuj bezwzględną ścieżkę. 2. Dodaj serwer MCP stdio na poziomie użytkownika do swojego klienta: - Nazwa: starcat - Polecenie: bezwzględna ścieżka z kroku 1 - Argumenty: ["mcp"] - Transport: stdio 3. Utrzymuj Starcat uruchomione z włączoną usługą MCP. 4. Uruchom ponownie lub przeładuj klienta MCP, a następnie wykonaj initialize i tools/list, a następnie wywołaj narzędzie tylko do odczytu starcat.get_capabilities. Nie konfiguruj punktu końcowego ani lokalnego klucza API w kliencie MCP.
pt_br: # Configurar o Serviço MCP do Starcat Manualmente 1. Execute `command -v starcat` e copie o caminho absoluto. 2. Adicione um Servidor MCP stdio em nível de usuário ao seu cliente: - Nome: starcat - Comando: o caminho absoluto da etapa 1 - Args: ["mcp"] - Transporte: stdio 3. Mantenha o Starcat em execução com o Serviço MCP ativado. 4. Reinicie ou recarregue o cliente MCP, conclua initialize e tools/list e chame a ferramenta somente leitura starcat.get_capabilities. Não configure um endpoint ou Chave de API Local no cliente MCP.
ru: # Настройка Starcat MCP-сервиса вручную 1. Выполните `command -v starcat` и скопируйте абсолютный путь. 2. Добавьте MCP-сервер stdio на уровне пользователя в ваш клиент: - Имя: starcat - Команда: абсолютный путь из шага 1 - Аргументы: ["mcp"] - Транспорт: stdio 3. Держите Starcat запущенным с включённым MCP-сервисом. 4. Перезапустите или перезагрузите MCP-клиент, затем выполните initialize и tools/list, и вызовите инструмент только для чтения starcat.get_capabilities. Не настраивайте конечную точку или локальный API-ключ в MCP-клиенте.
tr: # Starcat MCP Servisini Manuel Olarak Yapılandır 1. `command -v starcat` komutunu çalıştırın ve mutlak yolu kopyalayın. 2. İstemcinize kullanıcı düzeyinde bir stdio MCP Sunucusu ekleyin: - Ad: starcat - Komut: 1. adımdaki mutlak yol - Argümanlar: ["mcp"] - Taşıma: stdio 3. MCP Servisi etkinken Starcat'ı çalışır durumda tutun. 4. MCP istemcisini yeniden başlatın veya yeniden yükleyin, ardından initialize ve tools/list'i tamamlayın ve salt okunur aracı starcat.get_capabilities'ı çağırın. MCP istemcisinde bir uç nokta veya Yerel API Anahtarı yapılandırmayın.
uk: # Налаштування Starcat MCP-сервісу вручну 1. Виконайте `command -v starcat` і скопіюйте абсолютний шлях. 2. Додайте MCP-сервер stdio на рівні користувача у ваш клієнт: - Назва: starcat - Команда: абсолютний шлях з кроку 1 - Аргументи: ["mcp"] - Транспорт: stdio 3. Тримайте Starcat запущеним з увімкненим MCP-сервісом. 4. Перезапустіть або перезавантажте MCP-клієнт, потім виконайте initialize та tools/list, і викличте інструмент лише для читання starcat.get_capabilities. Не налаштовуйте кінцеву точку або локальний API-ключ у MCP-клієнті.
vi: # Cấu hình thủ công dịch vụ Starcat MCP 1. Chạy `command -v starcat` và sao chép đường dẫn tuyệt đối. 2. Thêm MCP Server stdio cấp người dùng vào ứng dụng khách của bạn: - Tên: starcat - Lệnh: đường dẫn tuyệt đối từ bước 1 - Đối số: ["mcp"] - Giao thức vận chuyển: stdio 3. Giữ Starcat chạy với dịch vụ MCP được bật. 4. Khởi động lại hoặc tải lại ứng dụng khách MCP, sau đó hoàn tất initialize và tools/list, và gọi công cụ chỉ đọc starcat.get_capabilities. Không cấu hình điểm cuối hoặc Khóa API cục bộ trong ứng dụng khách MCP.
zh_hans: # 手动配置 Starcat MCP Service 1. 运行 `command -v starcat` 并复制绝对路径。 2. 在 MCP 客户端中添加用户级 stdio MCP Server： - Name: starcat - Command: 第 1 步得到的绝对路径 - Args: ["mcp"] - Transport: stdio 3. 保持 Starcat 运行并开启 MCP Service。 4. 重启或重新加载 MCP 客户端，然后完成 initialize 和 tools/list，并调用只读工具 starcat.get_capabilities。 不要在 MCP 客户端中配置 endpoint 或 Local API Key。
zh_hant: # 手動設定 Starcat MCP Service 1. 執行 `command -v starcat` 並複製絕對路徑。 2. 在 MCP 用戶端中新增使用者級 stdio MCP Server： - Name: starcat - Command: 第 1 步得到的絕對路徑 - Args: ["mcp"] - Transport: stdio 3. 保持 Starcat 執行並開啟 MCP Service。 4. 重新啟動或重新載入 MCP 用戶端，然後完成 initialize 和 tools/list，並呼叫唯讀工具 starcat.get_capabilities。 不要在 MCP 用戶端中設定 endpoint 或 Local API Key。
